---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR
source: html/0520949b-2fd0-ca3c-bc98-c259e28d29d1.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR

Defines parameters for pipes.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralR : StructuralSectionRound
```